---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRepeat
source: html/770d919e-e99a-7062-b83a-e3d7dfc2a868.htm
---
# Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPatternRepeat Property

Pattern Repeat.

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemSegmentPatternRepeat { get; }
```